In [ ]:
pip install panda

In [16]:
import pandas as pd
import numpy as np

In [3]:
df = pd.read_csv(r'C:\Users\aashutosh\Downloads\data.csv')

In [4]:
df

,CountryName,CountryCode,BirthRate,InternetUsers,IncomeGroup
0,Aruba,ABW,10.244,78.9,High income
1,Afghanistan,AFG,35.253,5.9,Low income
2,Angola,AGO,45.985,19.1,Upper middle income
3,Albania,ALB,12.877,57.2,Upper middle income
4,United Arab Emirates,ARE,11.044,88.0,High income
...,...,...,...,...,...
190,"Yemen, Rep.",YEM,32.947,20.0,Lower middle income
191,South Africa,ZAF,20.850,46.5,Upper middle income
192,"Congo, Dem. Rep.",COD,42.394,2.2,Low income
193,Zambia,ZMB,40.471,15.4,Lower middle income
194,Zimbabwe,ZWE,35.715,18.5,Low income

In [10]:
data = {
    'name':['ram','shayam','ghan'],
    'age':[10,20,30],
    'city':['nagpur','mumbai','delhi']
}
df = pd.DataFrame(data)
df

     name  age    city
0     ram   10  nagpur
1  shayam   20  mumbai
2    ghan   30   delhi

In [11]:
df.to_csv('output.csv')

In [12]:
df.to_excel('output.xlsx',index=False)

In [13]:
df.to_json('output.json')

In [15]:
df = pd.read_csv(r'C:\Users\aashutosh\Downloads\data.csv')

print('display 10 rows of first')
print(df.head(10))

print('display 10 rows od last')
df.tail(10)

display 10 rows of first
            CountryName CountryCode  BirthRate  InternetUsers  \
0                 Aruba         ABW     10.244        78.9000
1           Afghanistan         AFG     35.253         5.9000
2                Angola         AGO     45.985        19.1000
3               Albania         ALB     12.877        57.2000
4  United Arab Emirates         ARE     11.044        88.0000
5             Argentina         ARG     17.716        59.9000
6               Armenia         ARM     13.308        41.9000
7   Antigua and Barbuda         ATG     16.447        63.4000
8             Australia         AUS     13.200        83.0000
9               Austria         AUT      9.400        80.6188

           IncomeGroup
0          High income
1           Low income
2  Upper middle income
3  Upper middle income
4          High income
5          High income
6  Lower middle income
7          High income
8          High income
9          High income
display 10 rows od last

,CountryName,CountryCode,BirthRate,InternetUsers,IncomeGroup
185,Virgin Islands (U.S.),VIR,10.700,45.3,High income
186,Vietnam,VNM,15.537,43.9,Lower middle income
187,Vanuatu,VUT,26.739,11.3,Lower middle income
188,West Bank and Gaza,PSE,30.394,46.6,Lower middle income
189,Samoa,WSM,26.172,15.3,Lower middle income
190,"Yemen, Rep.",YEM,32.947,20.0,Lower middle income
191,South Africa,ZAF,20.850,46.5,Upper middle income
192,"Congo, Dem. Rep.",COD,42.394,2.2,Low income
193,Zambia,ZMB,40.471,15.4,Lower middle income
194,Zimbabwe,ZWE,35.715,18.5,Low income

In [16]:
df = pd.read_csv(r'C:\Users\aashutosh\Downloads\data.csv')

print('displaying the info of data')
print(df.info())

displaying the info of data
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 195 entries, 0 to 194
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   CountryName    195 non-null    object
 1   CountryCode    195 non-null    object
 2   BirthRate      195 non-null    float64
 3   InternetUsers  195 non-null    float64
 4   IncomeGroup    195 non-null    object
dtypes: float64(2), object(3)
memory usage: 7.7+ KB
None

In [18]:
data = {
    'name':['ram','shayam','ghan'],
    'age':[10,20,30],
    'city':['nagpur','mumbai','delhi']
}
df = pd.DataFrame(data)
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   age     3 non-null      int64
 2   city    3 non-null      object
dtypes: int64(1), object(2)
memory usage: 204.0+ bytes
None

In [20]:
data = {
    'name':['ram','shaym','ghanshyam','dhanshyam','aditi','jaggu'],
    'age':[10,20,30,40,50,50],
    'salary':[20000,30000,40000,200000,40000,49990],
    'performance':[80,90,30,45,67,78]
}
df = pd.DataFrame(data)
print('sample dataframe')

print(df)
print('descriptive stats')
print(df.describe())

sample dataframe
        name  age  salary  performance
0        ram   10   20000           80
1      shaym   20   30000           90
2  ghanshyam   30   40000           30
3  dhanshyam   40  200000           45
4      aditi   50   40000           67
5      jaggu   50   49990           78
descriptive stats
             age         salary  performance
count   6.000000       6.000000      6.00000
mean   33.333333   63331.666667     65.00000
std    16.329932   67725.327734     23.01304
min    10.000000   20000.000000     30.00000
25%    22.500000   32500.000000     50.50000
50%    35.000000   40000.000000     72.50000
75%    47.500000   47492.500000     79.50000
max    50.000000  200000.000000     90.00000

In [ ]:
'''
1- how big is your dataset
2-what are the names of clomnd
'''

In [3]:
data = {
    'name':['ram','shaym','ghanshyam','dhanshyam','aditi','jaggu'],
    'age':[10,20,30,40,50,50],
    'salary':[20000,30000,40000,200000,40000,49990],
    'performance':[80,90,30,45,67,78]
}
df = pd.DataFrame(data)

print('sample dataframe')

print(df)
print(f'shape :{df.shape}')
print(f'column name: {df.columns}')

sample dataframe
        name  age  salary  performance
0        ram   10   20000           80
1      shaym   20   30000           90
2  ghanshyam   30   40000           30
3  dhanshyam   40  200000           45
4      aditi   50   40000           67
5      jaggu   50   49990           78
shape :(6, 4)
column name: Index(['name', 'age', 'salary', 'performance'], dtype='object')

In [6]:
data = {
    'name':['ram','shaym','ghanshyam','dhanshyam','aditi','jaggu'],
    'age':[10,20,30,40,50,50],
    'salary':[20000,30000,40000,200000,40000,49990],
    'performance':[80,90,30,45,67,78]
}
df = pd.DataFrame(data)

print('sample Dataframe')
print(df)
print('names (single column return series)')
name = df['name']
print(df['name'])
print(name)

sample Dataframe
        name  age  salary  performance
0        ram   10   20000           80
1      shaym   20   30000           90
2  ghanshyam   30   40000           30
3  dhanshyam   40  200000           45
4      aditi   50   40000           67
5      jaggu   50   49990           78
names (single column return series)
0          ram
1        shaym
2    ghanshyam
3    dhanshyam
4        aditi
5        jaggu
Name: name, dtype: object
0          ram
1        shaym
2    ghanshyam
3    dhanshyam
4        aditi
5        jaggu
Name: name, dtype: object

In [7]:
subset = df[['name','salary']]
print('\nsubset with name and salary')
print(subset)

subset with name and salary
        name  salary
0        ram   20000
1      shaym   30000
2  ghanshyam   40000
3  dhanshyam  200000
4      aditi   40000
5      jaggu   49990

In [12]:
data = {
    'name':['ram','shaym','ghanshyam','dhanshyam','aditi','jaggu'],
    'age':[10,20,30,40,50,50],
    'salary':[20000,30000,40000,200000,40000,49990],
    'performance':[80,90,30,45,67,78]
}
df = pd.DataFrame(data)

high_salary = df[(df['salary']>20000)]
print('employees with salary>520000')
print(high_salary)

employees with salary>520000
        name  age  salary  performance
1      shaym   20   30000           90
2  ghanshyam   30   40000           30
3  dhanshyam   40  200000           45
4      aditi   50   40000           67
5      jaggu   50   49990           78

In [9]:
filtered = df[(df['age']>10) &(df['salary']>2000)]
print('employee list age >10 + salary >20000')
print(filtered)

employee list age >10 + salary >20000
        name  age  salary  performance
1      shaym   20   30000           90
2  ghanshyam   30   40000           30
3  dhanshyam   40  200000           45
4      aditi   50   40000           67
5      jaggu   50   49990           78

In [11]:
filtered_or = df[(df['age']>20) | (df['performance']>40)]
print('employees with age>20 or performance > 40')
print(filtered_or)

employees with age>20 or performance > 40
        name  age  salary  performance
0        ram   10   20000           80
1      shaym   20   30000           90
2  ghanshyam   30   40000           30
3  dhanshyam   40  200000           45
4      aditi   50   40000           67
5      jaggu   50   49990           78

In [4]:
data = {
    'name':['ram','shaym','ghanshyam','dhanshyam','aditi','jaggu'],
    'age':[10,20,30,40,50,50],
    'salary':[20000,30000,40000,200000,40000,49990],
    'performance':[80,90,30,45,67,78]
}
df = pd.DataFrame(data)
print(df)

df['bonus'] = df['salary']*0.1
print(df)

        name  age  salary  performance
0        ram   10   20000           80
1      shaym   20   30000           90
2  ghanshyam   30   40000           30
3  dhanshyam   40  200000           45
4      aditi   50   40000           67
5      jaggu   50   49990           78
        name  age  salary  performance    bonus
0        ram   10   20000           80   2000.0
1      shaym   20   30000           90   3000.0
2  ghanshyam   30   40000           30   4000.0
3  dhanshyam   40  200000           45  20000.0
4      aditi   50   40000           67   4000.0
5      jaggu   50   49990           78   4999.0

In [5]:
data = {
    'name':['ram','shaym','ghanshyam','dhanshyam','aditi','jaggu'],
    'age':[10,20,30,40,50,50],
    'salary':[20000,30000,40000,200000,40000,49990],
    'performance':[80,90,30,45,67,78]
}
df = pd.DataFrame(data)
print(df)

df['bonus'] = df['salary']*0.1
print(df)

df.insert(0,'employee id', [10,20,30,40,50,60])
print(df)

        name  age  salary  performance
0        ram   10   20000           80
1      shaym   20   30000           90
2  ghanshyam   30   40000           30
3  dhanshyam   40  200000           45
4      aditi   50   40000           67
5      jaggu   50   49990           78
        name  age  salary  performance    bonus
0        ram   10   20000           80   2000.0
1      shaym   20   30000           90   3000.0
2  ghanshyam   30   40000           30   4000.0
3  dhanshyam   40  200000           45  20000.0
4      aditi   50   40000           67   4000.0
5      jaggu   50   49990           78   4999.0
   employee id       name  age  salary  performance    bonus
0           10        ram   10   20000           80   2000.0
1           20      shaym   20   30000           90   3000.0
2           30  ghanshyam   30   40000           30   4000.0
3           40  dhanshyam   40  200000           45  20000.0
4           50      aditi   50   40000           67   4000.0
5           60      jaggu   50   49990           78   4999.0

In [6]:
data = {
    'name':['ram','shaym','ghanshyam','dhanshyam','aditi','jaggu'],
    'age':[10,20,30,40,50,50],
    'salary':[20000,30000,40000,200000,40000,49990],
    'performance':[80,90,30,45,67,78]
}
df = pd.DataFrame(data)
print(df)

df.loc[0,'salary'] = 55000
print(df)

        name  age  salary  performance
0        ram   10   20000           80
1      shaym   20   30000           90
2  ghanshyam   30   40000           30
3  dhanshyam   40  200000           45
4      aditi   50   40000           67
5      jaggu   50   49990           78
        name  age  salary  performance
0        ram   10   55000           80
1      shaym   20   30000           90
2  ghanshyam   30   40000           30
3  dhanshyam   40  200000           45
4      aditi   50   40000           67
5      jaggu   50   49990           78

In [7]:
data = {
    'name':['ram','shaym','ghanshyam','dhanshyam','aditi','jaggu'],
    'age':[10,20,30,40,50,50],
    'salary':[20000,30000,40000,200000,40000,49990],
    'performance':[80,90,30,45,67,78]
}
df = pd.DataFrame(data)
print(df)

print('modified data')

df.drop(columns = ['performance'], inplace=True)

print(df)

        name  age  salary  performance
0        ram   10   20000           80
1      shaym   20   30000           90
2  ghanshyam   30   40000           30
3  dhanshyam   40  200000           45
4      aditi   50   40000           67
5      jaggu   50   49990           78
modified data
        name  age  salary
0        ram   10   20000
1      shaym   20   30000
2  ghanshyam   30   40000
3  dhanshyam   40  200000
4      aditi   50   40000
5      jaggu   50   49990

In [8]:
data = {
    'name':['ram','shaym','ghanshyam','dhanshyam','aditi','jaggu'],
    'age':[10,20,30,40,50,50],
    'salary':[20000,30000,40000,200000,40000,49990],
    'performance':[80,90,30,45,67,78]
}
df = pd.DataFrame(data)
print(df)

print('modified data')

df.drop(columns = ['performance','age'], inplace=True)

print(df)

        name  age  salary  performance
0        ram   10   20000           80
1      shaym   20   30000           90
2  ghanshyam   30   40000           30
3  dhanshyam   40  200000           45
4      aditi   50   40000           67
5      jaggu   50   49990           78
modified data
        name  salary
0        ram   20000
1      shaym   30000
2  ghanshyam   40000
3  dhanshyam  200000
4      aditi   40000
5      jaggu   49990

In [9]:
data = {
    'name':['ram','shaym','ghanshyam','dhanshyam','aditi','jaggu'],
    'age':[10,20,30,40,50,50],
    'salary':[20000,30000,40000,200000,40000,49990],
    'performance':[80,90,30,45,67,78]
}
df = pd.DataFrame(data)
print(df)

print('modified data')

df.drop(columns = ['performance','age'], inplace=False)

print(df)

        name  age  salary  performance
0        ram   10   20000           80
1      shaym   20   30000           90
2  ghanshyam   30   40000           30
3  dhanshyam   40  200000           45
4      aditi   50   40000           67
5      jaggu   50   49990           78
modified data
        name  age  salary  performance
0        ram   10   20000           80
1      shaym   20   30000           90
2  ghanshyam   30   40000           30
3  dhanshyam   40  200000           45
4      aditi   50   40000           67
5      jaggu   50   49990           78

In [10]:
#handling missing data

In [12]:
data = {
    'name':['ram',None,'ghanshyam','dhanshyam','aditi','jaggu'],
    'age':[10,None,30,40,50,50],
    'salary':[20000,None,40000,200000,40000,49990],
    'performance':[80,None,30,45,67,78]
}
df = pd.DataFrame(data)
print(df)

print(df.isnull())

        name   age    salary  performance
0        ram  10.0   20000.0         80.0
1       None   NaN       NaN          NaN
2  ghanshyam  30.0   40000.0         30.0
3  dhanshyam  40.0  200000.0         45.0
4      aditi  50.0   40000.0         67.0
5      jaggu  50.0   49990.0         78.0
    name    age  salary  performance
0  False  False   False        False
1   True   True    True         True
2  False  False   False        False
3  False  False   False        False
4  False  False   False        False
5  False  False   False        False

In [13]:
data = {
    'name':['ram',None,'ghanshyam','dhanshyam','aditi','jaggu'],
    'age':[10,None,30,40,50,50],
    'salary':[20000,None,40000,200000,40000,49990],
    'performance':[80,None,30,45,67,78]
}
df = pd.DataFrame(data)
print(df)

print(df.isnull().sum())

        name   age    salary  performance
0        ram  10.0   20000.0         80.0
1       None   NaN       NaN          NaN
2  ghanshyam  30.0   40000.0         30.0
3  dhanshyam  40.0  200000.0         45.0
4      aditi  50.0   40000.0         67.0
5      jaggu  50.0   49990.0         78.0
name           1
age            1
salary         1
performance    1
dtype: int64

In [14]:
data = {
    'name':['ram',None,'ghanshyam','dhanshyam','aditi','jaggu'],
    'age':[10,None,30,40,50,50],
    'salary':[20000,None,40000,200000,40000,49990],
    'performance':[80,None,30,45,67,78]
}
df = pd.DataFrame(data)
print(df)

df.dropna(inplace=True)
print(df)

        name   age    salary  performance
0        ram  10.0   20000.0         80.0
1       None   NaN       NaN          NaN
2  ghanshyam  30.0   40000.0         30.0
3  dhanshyam  40.0  200000.0         45.0
4      aditi  50.0   40000.0         67.0
5      jaggu  50.0   49990.0         78.0
        name   age    salary  performance
0        ram  10.0   20000.0         80.0
2  ghanshyam  30.0   40000.0         30.0
3  dhanshyam  40.0  200000.0         45.0
4      aditi  50.0   40000.0         67.0
5      jaggu  50.0   49990.0         78.0

In [3]:
data = {
    'name':['ram',None,'ghanshyam','dhanshyam','aditi','jaggu'],
    'age':[10,None,30,40,50,50],
    'salary':[20000,None,40000,200000,40000,49990],
    'performance':[80,None,30,45,67,78]
}
df = pd.DataFrame(data)
print(df)

df.fillna(0,inplace=True)
print(df)

        name   age    salary  performance
0        ram  10.0   20000.0         80.0
1       None   NaN       NaN          NaN
2  ghanshyam  30.0   40000.0         30.0
3  dhanshyam  40.0  200000.0         45.0
4      aditi  50.0   40000.0         67.0
5      jaggu  50.0   49990.0         78.0
        name   age    salary  performance
0        ram  10.0   20000.0         80.0
1          0   0.0       0.0          0.0
2  ghanshyam  30.0   40000.0         30.0
3  dhanshyam  40.0  200000.0         45.0
4      aditi  50.0   40000.0         67.0
5      jaggu  50.0   49990.0         78.0

In [6]:
data = {
    'name':['ram',None,'ghanshyam','dhanshyam','aditi','jaggu'],
    'age':[10,None,30,40,50,50],
    'salary':[20000,None,40000,200000,40000,49990],
    'performance':[80,None,30,45,67,78]
}
df = pd.DataFrame(data)
print(df)

df['age'].fillna(df['age'].mean(),inplace=True)
df['salary'].fillna(df['salary'].mean(),inplace=True)
print(df)

        name   age    salary  performance
0        ram  10.0   20000.0         80.0
1       None   NaN       NaN          NaN
2  ghanshyam  30.0   40000.0         30.0
3  dhanshyam  40.0  200000.0         45.0
4      aditi  50.0   40000.0         67.0
5      jaggu  50.0   49990.0         78.0
        name   age    salary  performance
0        ram  10.0   20000.0         80.0
1       None  36.0   69998.0          NaN
2  ghanshyam  30.0   40000.0         30.0
3  dhanshyam  40.0  200000.0         45.0
4      aditi  50.0   40000.0         67.0
5      jaggu  50.0   49990.0         78.0

C:\Users\aashutosh\AppData\Local\Temp\ipykernel_16376\4014216388.py:10: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['age'].fillna(df['age'].mean(),inplace=True)
C:\Users\aashutosh\AppData\Local\Temp\ipykernel_16376\4014216388.py:11: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['salary'].fillna(df['salary'].mean(),inplace=True)

In [7]:
data = {
    'time' : [1,2,3,4,5],
    'value' : [10,None,30,None,50]
}

df = pd.DataFrame(data)
print('before interpolation')

df['value']=df['value'].interpolate(method='linear')

print('after interpolation')
print(df)

before interpolation
after interpolation
   time  value
0     1   10.0
1     2   20.0
2     3   30.0
3     4   40.0
4     5   50.0

In [8]:
#sorting and aggregation

In [11]:
data = {
    'name':['arun','varun','karun'],
    'age':[28,34,22],
    'salary': [10000,200000,30000]

}

df = pd.DataFrame(data)
df.sort_values(by='age',ascending=False, inplace=True)
print('sorted age by descending ')
print(df)

sorted age by descending
    name  age  salary
1  varun   34  200000
0   arun   28   10000
2  karun   22   30000

In [12]:
data = {
    'name':['arun','varun','karun'],
    'age':[28,34,22],
    'salary': [10000,200000,30000]

}

df = pd.DataFrame(data)
df.sort_values(by='age',ascending=True, inplace=True)
print('sorted age by descending ')
print(df)

sorted age by descending
    name  age  salary
2  karun   22   30000
0   arun   28   10000
1  varun   34  200000

In [13]:
data = {
    'name':['arun','varun','karun'],
    'age':[28,34,22],
    'salary': [10000,200000,30000]

}

df = pd.DataFrame(data)
df.sort_values(by=['age','salary'],ascending=[True,False], inplace=True)
print('sorted age by descending ')
print(df)

sorted age by descending
    name  age  salary
2  karun   22   30000
0   arun   28   10000
1  varun   34  200000

In [17]:
data = {
    'name':['arun','varun','karun','dharun','marun'],
    'age':[28,34,22,34,28],
    'salary': [50000,60000,45000,52000,48000]

}

df=pd.DataFrame(data)
grouped = df.groupby('age')['salary'].sum()
print(grouped)

age
22     45000
28     98000
34    112000
Name: salary, dtype: int64

In [18]:
data = {
    'name':['arun','varun','karun','dharun','marun'],
    'age':[28,34,22,34,28],
    'salary': [50000,60000,45000,52000,48000]

}

df=pd.DataFrame(data)
grouped = df.groupby(['age','name'])['salary'].sum()
print(grouped)

age  name
22   karun     45000
28   arun      50000
     marun     48000
34   dharun    52000
     varun     60000
Name: salary, dtype: int64

In [22]:
df_customers = pd.DataFrame({
    'customerId':[1,2,3],
    'name':['ramesh','suresh','kalpesh']
})

df_orders = pd.DataFrame({
    'customerId':[1,2,3],
    'orderamount':[250,450,350]
})

df_merge = pd.merge(df_customers,df_orders, on='customerId', how='inner')
print('inner join')
print(df_merge)

inner join
   customerId     name  orderamount
0           1   ramesh          250
1           2   suresh          450
2           3  kalpesh          350

In [23]:
df_customers = pd.DataFrame({
    'customerId':[1,2,3],
    'name':['ramesh','suresh','kalpesh']
})

df_orders = pd.DataFrame({
    'customerId':[1,2,3],
    'orderamount':[250,450,350]
})

df_merge = pd.merge(df_customers,df_orders, on='customerId', how='outer')
print('inner join')
print(df_merge)

inner join
   customerId     name  orderamount
0           1   ramesh          250
1           2   suresh          450
2           3  kalpesh          350

In [25]:
df_customers = pd.DataFrame({
    'customerId':[1,2,3],
    'name':['ramesh','suresh','kalpesh']
})

df_orders = pd.DataFrame({
    'customerId':[1,2,3],
    'orderamount':[250,450,350]
})

df_merge = pd.merge(df_customers,df_orders, on='customerId', how='cross')
print('inner join')
print(df_merge)

MergeError: Can not pass on, right_on, left_on or set right_index=True or left_index=True

In [28]:
df_region1 = pd.DataFrame({
    'customerid':[1,2],
    'name':['gopal','raju']
})

df_region2 = pd.DataFrame({
    "customerid":[3,4],
    'name':['shyam','babu']
})

df_concat = pd.concat([df_region1, df_region2], ignore_index=True)
print(df_concat)

   customerid   name
0           1  gopal
1           2   raju
2           3  shyam
3           4   babu